{
  "version": "0.6",
  "pageContent": 
  {
    "_comments": "JSON object that contains data for page labels, buttons, etc.",
    "navItems": 
    {
      "_common": 
      {
        "buttonBackToGallery": 
        {
          "name": "Back To Gallery",
          "method": "backToGallery()",
          "idName": "backToGallery"  
        },
        "buttonStartTutorial": 
        {
          "name": "Start Tutorial",
          "method": "startTutorialFromDetailsScreen()",
          "idName": "startTutorial"
        },
        "buttonViewDetails": 
        {
          "name": "View Details",
          "method": "viewDetails()",
          "idName": "stepsViewDetails"  
        }
      }
    }
  },
  "tutorial": 
  {
    "_common": 
    {
      "name": "Hybrid Connect Logging",
      "shortDescription": "Learn how to register IBM Integration Bus with the Hybrid Connect logging (Logmet) service.",
      "durationText": "This tutorial takes approximately",
      "durationTime": "10 minutes",
      "_resourceToOpenComment": "The ID of the first resource to open when the user imports the tutorial. Resource IDs are defined in the repo_metadata.json Tutorials listing on ot4i.",
      "resourceToOpen": "MainFlow",
      "helpLink": 
      {
        "text": "IBM Knowledge Center",
        "link": "/com.ibm.etools.msgbroker.helphome.doc/help_home_msgbroker.htm"
      }
    },
    "pageDetails": 
    {
      "topicsName": "Tutorial Topics",
      "_topicListComment": "A short list of product concepts or tasks demonstrated by this tutorial",
      "topicList": 
      [
        {
          "title": "Registing IBM Integration Bus logs with Hybrid Connect Logging (Logmet) service"
        }
      ],
      "outcomesName": "Learning outcomes",
      "_outcomesComment": "A description of what the user will have learned or accomplished by running this tutorial.",
      "outcomeList": 
      [
        {
          "title": "Registing IBM Integration Bus with Hybrid Connect Logging (Logmet) service."
        }
      ],
      "summary": 
      {
        "overviewName": "OVERVIEW",
        "_overviewComment": "A short description of what happens in this tutorial, and an optional short explanation of the IIB concepts used in this tutorial if necessary for context. What background knowledge must the user have for this to make sense?",
        "sections": 
        [
          {
            "section": "This tutorial demonstrates how to display the IBM Integration Bus Dashboard using Kibana 4 in the Hybrid Connect Logging (Logmet) service."
          },
          {
            "section": "The Logmet service can be set up to receive logs from IBM Integration Bus. IBM Integration Bus provide a sample Kibana dashboard that user can change or replace with charts and tables of their own. You can use this to do data discovery and data analysis."
          }
        ]
      },
      "helpLinks": 
      {
        "_helpLinksComment": "Helplinks that have a type:web attribute are rendered as web links. Otherwise, links are assumed to be to embedded Help topics in the Knowledge Center.",
        "title": "Find out more",
        "details": 
        [
          {
            "title": "Knowledge Center link to ",
            "description": "Developing integration solutions by using applications",
            "link": "com.ibm.etools.mft.doc/bi12002_.htm",
            "type": "help"
          },
          {
            "title": "GitHub link to ",
            "description": "DFDL Schemas",
            "link": "http://github.com/DFDLSchemas",
            "type": "web"
          }
        ]
      }
    },
    "pageSteps": 
    {
      "create": 
      {
        "overview": 
        {
          "name": "Create",
          "heading": "Import projects",
          "_createComment": "A description of what will happen when the user clicks Import.",
          "sections": 
          [
            {
              "section": "When you click Import, the <b>LogMessages</b> application will be created in you workspace."
            },
            {
              "section": "<b>LogMessages</b> uses the <b>Compute</b> node to log different types of messages into the system log and also a <b>Trace</b> node for tracking the execution of the flow. This will be use as a way to create data for the Logmet service."
            }
          ]
        },
        "actions": 
        {
          "title": "Create Actions",
          "details": 
          [
            {
              "name": "Import",
              "method": "importArtifacts()"
            }
          ]
        }
      },
      "prepare": 
      {
        "overview": 
        {
          "name": "Prepare",
          "heading": "Configuring IBM Integration Bus Kibana dashboard",
          "_prepareComment": "A description of what just happened when the user clicked Import, and what will happen when the user clicks Deploy.",
          "sections": 
          [
            {
              "section": "Follow the instructions below to configuration an integration server to the IBM Integration Bus Kibana dashboard.",
              "steps":
              {
                "type": "ordered",
                "details":
                [
                  {
                    "details": "Follow the instructions in <b>Configuring the integration server and loading the IBM Integration Bus Kibana dashboard manually</b> of the Knowledge Center to setup and import all thes into <b>Kibana 4</b>."
                  },
                  {
                    "details": "Once everything are imported, select the <b>Dashboard</b> tab under <b>Kibana 4</b> and click on <b>Load Saved Dasboard</b> (open folder) button."
                  },
                  {
                    "details": "Under the <b>Dashboard Filter</b> entry field, select <b>IBM Integration Bus Dashboard</b>, this will open the imported dashboard with the predefined visuals."
                  },
                  {
                    "details": "If the visuals are displaying the message <b>No results found</b>, try changing the time filter (clock icon on top right) to a larger value."
                  }
                ]
              }
            }
          ]
        }
      },
      "run": 
      {
        "overview": 
        {
          "name": "Run",
          "heading": "Follow these steps to complete the tutorial",
          "_runComment": "The full steps for the user to run through the tutorial. Use 'sections' to render paragraphs, 'steps' with a type of 'ordered' or 'unordered' to render HTML lists, and 'substeps' to render nested lists.",
          "sections": 
          [
            {
              "section": "Deploy the <b>LogMessages</b> application to your integration server and run it a few times to generate some data for the log."
            },
            {
              "section": "Use the instruction below to create a custom chart to track a specific IBM Integration Bus log messages:",
              "steps":
              {
                "type": "ordered",
                "details":
                [
                  {
                    "details": "In <b>Kibana 4</b> click on <b>Visualize</b> and then <b>Vertical bar chart</b>."
                  },
                  {
                    "details": "Select <b>From a saved search</b>, and then <b>IBM Log Events</b>."
                  },
                  {
                    "details": "Click on <b>X-Axis</b> as the bucket type."
                  },
                  {
                    "details": "Under <b>Aggregation</b>, select <b>Date Histogram</b>."
                  },
                  {
                    "details": "Click on <b>Add sub-buckets</b<, and select <b>Split Bars</b>."
                  },
                  {
                    "details": "In the <b>Sub Aggregation</b> field select <b>Filters</b>."
                  },
                  {
                    "details": "Enter <b>ibm_messageId:3051</b> into <b>Filter 1</b> and press the <b>Apply changes</b> (white triangle in a green background) button to update the chart to show data for message id 3051."
                  },
                  {
                    "details": "Click on the <b>Save Visualize</b> (small disk icon on top right) to save the chart."
                  },
                  {
                    "details": "Once the chart is saved, it can be add to the dashboard by clicking on the <b>Add Visualization</b> button."
                  },
                  {
                    "details": "Select the new chart from the list and it will be added to the bottom of the dashboard. You can move and resize it, or replace an existing one in the dashboard."
                  }
                ]
              }
            },
            {
              "section": "This tutorial has shown how to register IBM Integration Bus with Hybrid Connect Logging service, and create new charts in Kibana to track a particular message."
            }
          ]
        },
        "helpLinks": 
        {
          "title": "Find out more",
          "details": 
          [
            {
              "title": "Knowledge Center link to ",
              "description": "Testing your message flow by using the Flow exerciser",
              "link": "com.ibm.etools.mft.doc/rt26110_.htm"
            }
          ]
        },
        "actions": 
        {
          "title": "Run Actions",
          "details": 
          [
            {
              "name": "Deploy",
              "method": "deployArtifacts()"
            }
          ]
        },
        "exits": 
        {
          "title": "Run Exits",
          "details": 
          [
            {
              "name": "Clean Up",
              "description": "Clean up and remove any changes in your workspace made by the tutorial.",
              "method": "cleanUp()"
            }
          ]
        }
      }
    }
  }
}